app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC
---
    def index
        @projects = Project.all.order(created_at: :desc)

INSERT INTO "projects" ("title", "description", "due_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @project = Project.new project_params
        if @project.save

UPDATE "projects" SET "title" = $1, "due_date" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["title", "Healthcare!"], ["due_date", "2020-04-03 00:00:00"], ["updated_at", "2020-01-19 10:21:28.617665"], ["id", 41]]
---
    def update
        if @project.update project_params

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 42]]
---
    def destroy
        @project.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
    def find_project
        @project = Project.find params[:id]