app/controllers/tasks_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
    def create
        @project = Project.find(params[:project_id])